app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def show #action that finds a particular post to make it available for display
    @post = Post.find(params[:id])